{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'0.3.29'"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from Embedding import Embedder\n",
    "import chromadb\n",
    "chromadb.__version__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "emb = Embedder(persistant_path=\"aopwiki\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "examples = emb.getRawExample()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "emb.embedExamples(examples=examples,collection_name=\"aopgraph\",)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "emb.get_collection(collection_name=\"aopgraph\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"What are the life stages in which aop 450 is applicable\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "### query the examples\n",
    "similar_query = emb.getSimilarExample(query=query,\n",
    "                                      count=10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.graphs import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': '4',\n",
       "  'question': 'Name the Key events and adverse outcome linked with AOP 155?',\n",
       "  'cypher': \"MATCH (aop:AOP)-[aop_key_event:HAS_KEY_EVENT]-(event:KEY_EVENT)\\n MATCH (aop:AOP)-[aop_adverse_outcome_relation:HAS_ADVERSE_OUTCOME]->(adverse_event:KEY_EVENT)\\n WHERE aop.ID = '155' \\n RETURN aop,event,adverse_event,aop_key_event,aop_adverse_outcome_relation,event.NAME, adverse_event.NAME;\"},\n",
       " {'id': '7',\n",
       "  'question': 'What are the evidences mentioned for supporting molecular intiating event of AOP 175?',\n",
       "  'cypher': \"MATCH (aop:AOP)-[relation:HAS_MOLECULAR_INITIATING_EVENT]-(event:KEY_EVENT)\\n WHERE aop.ID = '175'\\n RETURN aop,relation,event,relation.`evidence-supporting-chemical-initiation`\"},\n",
       " {'id': '6',\n",
       "  'question': 'Describe the key event with ID 618.',\n",
       "  'cypher': \"MATCH (event:KEY_EVENT)\\n WHERE event.ID = '618' \\n RETURN event,event.NAME, event.`biological-organization-level`, event.`measurement-methodology`, event.`evidence-supporting-taxonomic-applicability`\"}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "similar_query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "from prompt import generateCypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "os.environ[\"OPENAI_API_KEY\"] = \"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\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "model = ChatOpenAI(temperature=0,model=\"gpt-4-0613\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"Provide all the Key event relationship of AOP 348\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = generateCypher(query=query,count=8,llm=model)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"MATCH (a:AOP {id:'348'})-[r:HAS_KER]->(ker:KEY_EVENT_RELATIONSHIP)\\nRETURN *\""
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "neo",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
