{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'0.3.23'"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from Embedding import Embedder\n",
    "import chromadb\n",
    "chromadb.__version__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Using embedded DuckDB with persistence: data will be stored in: C:\\Users\\saurav\\OneDrive - URV\\saurav kumar\\PARC\\Text Mining\\AOPWiki_Explorer\\backend\\aopwiki\n"
     ]
    }
   ],
   "source": [
    "emb = Embedder(persistant_path=\"aopwiki\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "examples = emb.getRawExample()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': '1',\n",
       "  'question': 'Find the stressors and Chemicals related to a specific Adverse Outcome Pathway (AOP) 450.',\n",
       "  'cypher': \"MATCH (aop:AOP)-[aop_stressor_relation:HAS_STRESSOR]-(stressor:STRESSOR)-[stressor_chemical_relation:HAS_CHEMICAL]-(chemical:CHEMICAL)\\nWHERE aop.id = '450'\\nRETURN *\"},\n",
       " {'id': '2',\n",
       "  'question': 'What chemicals or stressor initiate molecular initiating event of AOP 15?',\n",
       "  'cypher': \"MATCH (aop:AOP{id:'23'})-[rel1:HAS_MOLECULAR_INITIATING_EVENT]-(event:KEY_EVENT)\\nMATCH (aop)-[rel2:HAS_STRESSOR]-(stressor:STRESSOR)\\nOPTIONAL MATCH (stressor)-[rel3:HAS_CHEMICAL]-(chemical:CHEMICAL)\\nRETURN *\"},\n",
       " {'id': '3',\n",
       "  'question': 'Name the Key events and adverse outcome linked with AOP 155?',\n",
       "  'cypher': \"MATCH (aop:AOP)-[rel1:HAS_KEY_EVENT]-(event:KEY_EVENT)\\nMATCH (aop:AOP)-[rel2:HAS_ADVERSE_OUTCOME]-(adverse_event:KEY_EVENT)\\nWHERE aop.id = '155'\\nRETURN *\"},\n",
       " {'id': '4',\n",
       "  'question': 'Provide the schema of graph database?',\n",
       "  'cypher': 'call db.schema.visualization'},\n",
       " {'id': '5',\n",
       "  'question': 'Give me the stressors and aop where these chemicals Nitrendipin,Tacrolimus are mentioned?',\n",
       "  'cypher': \"MATCH (a:AOP)-[rel:HAS_STRESSOR]-(b:STRESSOR)\\nWHERE b.name =~ '.*Nitrendipin.*' OR b.name =~ '.*Tacrolimus .*'\\nOPTIONAL MATCH (b)-[rel2:HAS_CHEMICAL]-(c:CHEMICAL)\\nRETURN *\"},\n",
       " {'id': '6',\n",
       "  'question': 'Can you provide me the shortestpath to connect AOP 450 and AOP 150, and this should be connected with key events only',\n",
       "  'cypher': \"MATCH (aop1:AOP{id:'150'}),(aop2:AOP{id:'464'})\\nMATCH path = shortestPath((aop1)-[:HAS_KEY_EVENT*]-(aop2))\\nRETURN path\"},\n",
       " {'id': '7',\n",
       "  'question': 'Can you provide me the shortestpath to connect AOP 450 and AOP 150, and this should be connected with key event relationship only',\n",
       "  'cypher': \"MATCH (aop1:AOP{id:'150'}),(aop2:AOP{id:'464'})\\nMATCH path = shortestPath((aop1)-[:HAS_KER*]-(aop2))\\nRETURN path\"},\n",
       " {'id': '8',\n",
       "  'question': 'Find the stressors and Chemicals related to a specific Adverse Outcome Pathway (AOP) 450.',\n",
       "  'cypher': \"MATCH (a:AOP {id:'450'})-[r1:HAS_STRESSOR]-(s:STRESSOR)-[r2:HAS_CHEMICAL]-(c:CHEMICAL)\\nRETURN *\"},\n",
       " {'id': '9',\n",
       "  'question': 'What stressors interact with the molecular initiating event of AOP 15?',\n",
       "  'cypher': \"MATCH (a:AOP {id:'150'})-[r1:HAS_MOLECULAR_INITIATING_EVENT]-(e:KEY_EVENT)\\nMATCH (a)-[r2:HAS_STRESSOR]->(s:STRESSOR)\\nRETURN *\"},\n",
       " {'id': '10',\n",
       "  'question': 'What are the key events and adverse outcome linked with AOP 155?',\n",
       "  'cypher': \"MATCH (a:AOP {id:'155'})-[r1:HAS_KEY_EVENT]->(e:KEY_EVENT)\\nMATCH (a)-[r2:HAS_ADVERSE_OUTCOME]->(adverse:KEY_EVENT)\\nRETURN *\"},\n",
       " {'id': '11',\n",
       "  'question': 'Give me the aop where ahr gene is involved and also the key event attached to that aop?',\n",
       "  'cypher': \"MATCH (a:AOP)-[rel:HAS_GENE]-(e:GENE)\\nWHERE toLower(e.name) =~ '.*ahr.*'\\nMATCH (a)-[rel2:HAS_KEY_EVENT]-(f:KEY_EVENT)\\nRETURN *\"},\n",
       " {'id': '12',\n",
       "  'question': 'AOPs which has ibuprofen as chemical or stressor',\n",
       "  'cypher': \"MATCH (a:AOP)-[rel1:HAS_STRESSOR]-(b:STRESSOR)\\nWHERE toLower(b.name) =~ '.*ibupr.*'\\nOPTIONAL MATCH (b)-[rel2:HAS_CHEMICAL]-(c:CHEMICAL)\\nWHERE toLower(c.name) =~ '.*ibupr.*'\\nRETURN *\"},\n",
       " {'id': '13',\n",
       "  'question': \"Provide the aop, which is connected with the adverse event of aop 450 and has applicability in Homo sapines taxonomy and 'sars' as stressor\",\n",
       "  'cypher': \"MATCH (a:AOP{id:'450'})-[rel:HAS_ADVERSE_OUTCOME]-(b:KEY_EVENT)\\nMATCH (b)-[rel2:HAS_ADVERSE_OUTCOME]-(c:AOP)\\nMATCH (c)-[rel3:IS_APPLICABLE]-(d:TAXONOMY{name:'Homo sapiens'})\\nMATCH (c)-[rel4:HAS_STRESSOR]-(e:STRESSOR)\\nWHERE toLower(e.name) =~ '.*sars.*'\\nRETURN *\"},\n",
       " {'id': '14',\n",
       "  'question': 'AOP with maximum number of key events attached to it',\n",
       "  'cypher': 'MATCH (aop:AOP)-[:HAS_KEY_EVENT]-(event:KEY_EVENT)\\nWITH aop, count(event) AS eventCount\\nORDER BY eventCount DESC\\nLIMIT 1\\nRETURN aop, eventCount'},\n",
       " {'id': '15',\n",
       "  'question': 'Event with maximum number of aop attached to it',\n",
       "  'cypher': 'MATCH (aop:AOP)-[:HAS_KEY_EVENT]-(event:KEY_EVENT)\\nWITH event, COUNT(aop) as aopCount\\nORDER BY aopCount DESC\\nLIMIT 1\\nRETURN *'},\n",
       " {'id': '16',\n",
       "  'question': 'provide me with the chemical and stressors involved in AOP 332',\n",
       "  'cypher': \"MATCH (a:AOP {id:'330'})-[r1:HAS_STRESSOR]-(s:STRESSOR)\\nOPTIONAL MATCH (s)-[r2:HAS_CHEMICAL]-(c:CHEMICAL)\\nRETURN *\"},\n",
       " {'id': '17',\n",
       "  'question': 'What are the adverse outcomes of aop , which has sars as stressor',\n",
       "  'cypher': \"MATCH (a:AOP)-[r1:HAS_ADVERSE_OUTCOME]->(adverse:KEY_EVENT)\\nMATCH (a)-[r2:HAS_STRESSOR]-(s:STRESSOR)\\nWHERE toLower(s.name) =~ '.*sars.*'\\nRETURN *\"},\n",
       " {'id': '18',\n",
       "  'question': 'provide me the aops which is related to mitochondrial dysfunction disease?',\n",
       "  'cypher': \"MATCH (a:AOP)-[rel1:HAS_DISEASE]-(b:DISEASE)\\nWHERE toLower(b.name) =~ '.*mitochondrial dysfunction.*'\\nRETURN *\"},\n",
       " {'id': '19',\n",
       "  'question': 'What are the life stages AOP 450 is applicable?',\n",
       "  'cypher': \"MATCH (a:AOP {id:'450'})-[r:IS_APPLICABLE]->(b:LIFE_STAGE) RETURN *\"},\n",
       " {'id': '20',\n",
       "  'question': 'what aops are associated with adult life stage?',\n",
       "  'cypher': \"MATCH (a:AOP)-[r:IS_APPLICABLE]->(b:LIFE_STAGE)\\nWHERE toLower(b.name) =~ '.*Adult' RETURN*\"},\n",
       " {'id': '21',\n",
       "  'question': 'what aops are associated with adult life stage?',\n",
       "  'cypher': \"MATCH (a:AOP)-[r:IS_APPLICABLE]->(b:LIFE_STAGE)\\nWHERE toLower(b.name) =~ '.*Adult' RETURN *\"},\n",
       " {'id': '22',\n",
       "  'question': 'Which is the most abudant life stage, the aops are applicable to.',\n",
       "  'cypher': 'MATCH (a:AOP)-[r:IS_APPLICABLE]->(l:LIFE_STAGE)\\nWITH l, count(a) AS aopCount\\nORDER BY aopCount DESC LIMIT 1\\nRETURN l'},\n",
       " {'id': '23',\n",
       "  'question': 'AOPs applicable to fish and rat?',\n",
       "  'cypher': \"MATCH (a:AOP)-[rel:IS_APPLICABLE]-(b:TAXONOMY)\\nWHERE toLower(b.name) =~ '.*fish.*' OR toLower(b.name) =~ '.*rat.*'\\nRETURN *\"},\n",
       " {'id': '24',\n",
       "  'question': 'AOPs having fertility or reproduction mentioned in their adverse outcomes?',\n",
       "  'cypher': \"MATCH (a:AOP)-[rel1:HAS_ADVERSE_OUTCOME]-(b:KEY_EVENT)\\nWHERE toLower(b.name) =~ '.*fertility.*' OR toLower(b.name) =~ '.*reproductive.*'\\nRETURN *\"},\n",
       " {'id': '25',\n",
       "  'question': 'Key events which are not related to female?',\n",
       "  'cypher': \"MATCH (ke:KEY_EVENT)-[rel1:IS_APPLICABLE]-(s:SEX)\\nWHERE toLower(s.name) <> 'female'\\nRETURN *\"},\n",
       " {'id': '26',\n",
       "  'question': 'key events related to male but not to female?',\n",
       "  'cypher': \"MATCH (ke:KEY_EVENT)-[rel1:IS_APPLICABLE]-(s:SEX)\\nWHERE toLower(s.name) = 'male' AND NOT (ke)-[:IS_APPLICABLE]->(:SEX {name: 'female'})\\nRETURN *\"},\n",
       " {'id': '27',\n",
       "  'question': 'AOPs related to unspecific sex',\n",
       "  'cypher': \"MATCH (a:AOP)-[rel1:IS_APPLICABLE]-(b:SEX)\\nWHERE toLower(b.name) = 'unspecific'\\nRETURN *\"}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "examples"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "emb.embedExamples(examples=examples,collection_name=\"aopgraph\",)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "emb.get_collection(collection_name=\"aopgraph\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"What are the life stages in which aop 450 is applicable\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "### query the examples\n",
    "similar_query = emb.getSimilarExample(query=query,\n",
    "                                      count=10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.graphs import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': '4',\n",
       "  'question': 'Name the Key events and adverse outcome linked with AOP 155?',\n",
       "  'cypher': \"MATCH (aop:AOP)-[aop_key_event:HAS_KEY_EVENT]-(event:KEY_EVENT)\\n MATCH (aop:AOP)-[aop_adverse_outcome_relation:HAS_ADVERSE_OUTCOME]->(adverse_event:KEY_EVENT)\\n WHERE aop.ID = '155' \\n RETURN aop,event,adverse_event,aop_key_event,aop_adverse_outcome_relation,event.NAME, adverse_event.NAME;\"},\n",
       " {'id': '7',\n",
       "  'question': 'What are the evidences mentioned for supporting molecular intiating event of AOP 175?',\n",
       "  'cypher': \"MATCH (aop:AOP)-[relation:HAS_MOLECULAR_INITIATING_EVENT]-(event:KEY_EVENT)\\n WHERE aop.ID = '175'\\n RETURN aop,relation,event,relation.`evidence-supporting-chemical-initiation`\"},\n",
       " {'id': '6',\n",
       "  'question': 'Describe the key event with ID 618.',\n",
       "  'cypher': \"MATCH (event:KEY_EVENT)\\n WHERE event.ID = '618' \\n RETURN event,event.NAME, event.`biological-organization-level`, event.`measurement-methodology`, event.`evidence-supporting-taxonomic-applicability`\"}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "similar_query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "from prompt import generateCypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "os.environ[\"OPENAI_API_KEY\"] = \"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\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "model = ChatOpenAI(temperature=0,model=\"gpt-4-0613\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"Provide all the Key event relationship of AOP 348\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = generateCypher(query=query,count=8,llm=model)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"MATCH (a:AOP {id:'348'})-[r:HAS_KER]->(ker:KEY_EVENT_RELATIONSHIP)\\nRETURN *\""
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
